In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['Pramod','rohan','shubh'],
    "marks":[99,45,76],
    "city":['bkr','sdd','dssd']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks  city
0  Pramod     99   bkr
1   rohan     45   sdd
2   shubh     76  dssd

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index=False)

In [7]:
df.head(2)

     name  marks city
0  Pramod     99  bkr
1   rohan     45  sdd

In [8]:
df.tail(2)

    name  marks  city
1  rohan     45   sdd
2  shubh     76  dssd

In [9]:
df.describe()

           marks
count   3.000000
mean   73.333333
std    27.098585
min    45.000000
25%    60.500000
50%    76.000000
75%    87.500000
max    99.000000

In [12]:
pramod=pd.read_csv('prem.csv')

In [13]:
pramod

   Unnamed: 0    name  marks  city
0           0  Pramod     99   bkr
1           1   rohan     45   sdd
2           2   shubh     76  dssd

In [14]:
pramod['marks']

0    99
1    45
2    76
Name: marks, dtype: int64

In [15]:
pramod['marks'][0]=90

/tmp/ipykernel_19064/2598035806.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pramod['marks'][0]=90

In [16]:
pramod

   Unnamed: 0    name  marks  city
0           0  Pramod     90   bkr
1           1   rohan     45   sdd
2           2   shubh     76  dssd

In [17]:
pramod.index=['first','second','third']

In [18]:
pramod

        Unnamed: 0    name  marks  city
first            0  Pramod     90   bkr
second           1   rohan     45   sdd
third            2   shubh     76  dssd